app/controllers/exams_controller.rb

SELECT "exams".* FROM "exams"
---
  def index
    @exams = Exam.all

INSERT INTO "exams" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 10 Feb 2014 00:37:19 UTC +00:00], ["name", "Exame 1"], ["updated_at", Mon, 10 Feb 2014 00:37:19 UTC +00:00]]
---
  def create
    @exam = Exam.new(exam_params)

    respond_to do |format|
      if @exam.save

UPDATE "exams" SET "name" = ?, "updated_at" = ? WHERE "exams"."id" = 2  [["name", "Sangue3edq"], ["updated_at", Sun, 09 Feb 2014 04:26:59 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @exam.update(exam_params)

DELETE FROM "exams" WHERE "exams"."id" = ?  [["id", 1]]
---
  def destroy
    @exam.destroy

SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_exam
      @exam = Exam.find(params[:id])