app/controllers/laboratories_controller.rb

  def index
    @laboratories = Laboratory.all
---
SELECT "laboratories".* FROM "laboratories"

  def create
    @laboratory = Laboratory.new(laboratory_params)

    respond_to do |format|
      if @laboratory.save
---
INSERT INTO "laboratories" ("created_at", "name", "password", "site", "updated_at", "user") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 10 Feb 2014 14:30:56 UTC +00:00], ["name", "CERPE"], ["password", ""], ["site", ""], ["updated_at", Mon, 10 Feb 2014 14:30:56 UTC +00:00], ["user", ""]]

  def update
    respond_to do |format|
      if @laboratory.update(laboratory_params)
---
UPDATE "laboratories" SET "user" = ?, "password" = ?, "site" = ?, "updated_at" = ? WHERE "laboratories"."id" = 2  [["user", "311"], ["password", "23"], ["site", "123"], ["updated_at", Sun, 09 Feb 2014 22:40:55 UTC +00:00]]

  def destroy
    @laboratory.destroy
---
DELETE FROM "laboratories" WHERE "laboratories"."id" = ?  [["id", 1]]

    def set_laboratory
      @laboratory = Laboratory.find(params[:id])
---
SELECT "laboratories".* FROM "laboratories" WHERE "laboratories"."id" = ? LIMIT 1  [["id", "2"]]